# Pandas Module :

This module helps us to play with data in data processing,One of the most use library for preparing data which will be used to train models

**Below we will learn all the steps which will be important in our data preparation**

In [1]:
# Import pandas
import pandas as pd

In [2]:
# Create a series of three different colours
colors=pd.Series(["Red","Black","White"])
colors

0      Red
1    Black
2    White
dtype: object

In [3]:
# View the series of different colours
colors

0      Red
1    Black
2    White
dtype: object

In [4]:
# Create a series of three different car types and view itca
cars=pd.Series(["BMW","AUdi","MG"])
cars

0     BMW
1    AUdi
2      MG
dtype: object

In [12]:
# Combine the Series of cars and colours into a DataFrame
df=pd.DataFrame({"Cars":cars,"colors ":colors})
df

   Cars colors
0   BMW     Red
1  AUdi   Black
2    MG   White

In [14]:
# Import "../data/car-sales.csv" and turn it into a DataFrame
car_sales=pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

**Note:** Since you've imported `../data/car-sales.csv` as a DataFrame, we'll now refer to this DataFrame as 'the car sales DataFrame'.

In [17]:
# Export the DataFrame you created to a .csv file
car_sales.to_csv("exported_car_sales.csv")

In [20]:
# Find the different datatypes of the car data DataFrame
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [21]:
# Describe your current car sales DataFrame using describe()
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [22]:
# Get information about your DataFrame using info
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

What does it show you?

In [24]:
# Create a Series of different numbers and find the mean of them
num=pd.Series([20,40,80,100])
num.mean()

np.float64(60.0)

In [25]:
# Create a Series of different numbers and find the sum of them
a=pd.Series([100,200,50,-50])
a.sum()

np.int64(300)

In [27]:
# List out all the column names of the car sales DataFrame
car_sale_column=car_sales.columns
car_sale_column

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [28]:
# Find the length of the car sales DataFrame
len(car_sales)

10

In [30]:
# Show the first 5 rows of the car sales DataFrame
car_sales.head(5)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [32]:
# Show the first 7 rows of the car sales DataFrame
car_sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [34]:
# Show the bottom 5 rows of the car sales DataFrame
car_sales.tail(5)

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [35]:
# Use .loc to select the row at index 3 of the car sales DataFrame
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [36]:
# Use .iloc to select the row at position 3 of the car sales DataFrame
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

Notice how they're the same? Why do you think this is? 

Check the pandas documentation for [.loc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html) and [.iloc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html). Think about a different situation each could be used for and try them out.

In [39]:
# Select the "Odometer (KM)" column from the car sales DataFrame
odometer=car_sales["Odometer (KM)"]
odometer

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [40]:
# Find the mean of the "Odometer (KM)" column in the car sales DataFrame
odometer.mean()

np.float64(78601.4)

In [47]:
# Select the rows with over 100,000 kilometers on the Odometer
odometer=car_sales[car_sales["Odometer (KM)"] >100000]
odometer

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [48]:
# Create a crosstab of the Make and Doors columns

pd.crosstab(car_sales["Make"],car_sales["Doors"])

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [59]:
# Group columns of the car sales DataFrame by the Make column and find the average
b=car_sales.groupby(["Make"])

In [63]:
# Import Matplotlib and create a plot of the Odometer column
# Don't forget to use %matplotlib inline
import matplotlib.pyplot as plt
%matplotlib inline

In [69]:
# Create a histogram of the Odometer column using hist()
car_sales["Odometer (KM)"].hist()

In [65]:
# Try to plot the Price column using plot()
car_sales["Price"].plot()

TypeError: no numeric data to plot

Why didn't it work? Can you think of a solution?

You might want to search for "how to convert a pandas string column to numbers".

And if you're still stuck, check out this [Stack Overflow question and answer on turning a price column into integers](https://stackoverflow.com/questions/44469313/price-column-object-to-int-in-pandas).

See how you can provide the example code there to the problem here.

In [74]:
# Remove the punctuation from price column
 #car_sales["Price"]=car_sales["Price"].str.replace('[\$\,\.]', '',regex=True).astype(int)
car_sales["Price"].replace('[\$\,\.]', '', regex=True).astype(int)

<>:3: SyntaxWarning: invalid escape sequence '\$'
<>:3: SyntaxWarning: invalid escape sequence '\$'
C:\Users\Saurabh Guru\AppData\Local\Temp\ipykernel_12740\4294130725.py:3: SyntaxWarning: invalid escape sequence '\$'
  car_sales["Price"].replace('[\$\,\.]', '', regex=True).astype(int)

0     400000
1     500000
2     700000
3    2200000
4     350000
5     450000
6     750000
7     700000
8     625000
9     970000
Name: Price, dtype: int64

In [73]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price             int64
dtype: object

In [75]:
# Check the changes to the price column
car_sales["Price"]

0     400000
1     500000
2     700000
3    2200000
4     350000
5     450000
6     750000
7     700000
8     625000
9     970000
Name: Price, dtype: int64

In [78]:
# Remove the two extra zeros at the end of the pri.ce column
car_sales["Price"]=car_sales["Price"]// 100

In [79]:
# Check the changes to the Price column
car_sales["Price"]

0     4000
1     5000
2     7000
3    22000
4     3500
5     4500
6     7500
7     7000
8     6250
9     9700
Name: Price, dtype: int64

In [80]:
# Change the datatype of the Price column to integers
car_sales["Price"]=car_sales["Price"].astype(int)

In [86]:
# Lower the strings of the Make column
car_sales["Make"].str.lower()

0    toyota
1     honda
2    toyota
3       bmw
4    nissan
5    toyota
6     honda
7     honda
8    toyota
9    nissan
Name: Make, dtype: object

If you check the car sales DataFrame, you'll notice the Make column hasn't been lowered.

How could you make these changes permanent?

Try it out.

In [87]:
# Make lowering the case of the Make column permanent
car_sales["Make"]=car_sales["Make"].str.lower()

In [88]:
# Check the car sales DataFrame
car_sales

     Make Colour  Odometer (KM)  Doors  Price
0  toyota  White         150043      4   4000
1   honda    Red          87899      4   5000
2  toyota   Blue          32549      3   7000
3     bmw  Black          11179      5  22000
4  nissan  White         213095      4   3500
5  toyota  Green          99213      4   4500
6   honda   Blue          45698      4   7500
7   honda   Blue          54738      4   7000
8  toyota  White          60000      4   6250
9  nissan  White          31600      4   9700

Notice how the Make column stays lowered after reassigning.

Now let's deal with missing data.

In [89]:
# Import the car sales DataFrame with missing data ("../data/car-sales-missing-data.csv")p
car_Sales_missing=pd.read_csv("car-sales-missing-data.csv")


# Check out the new DataFrame
car_Sales_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

Notice the missing values are represented as `NaN` in pandas DataFrames.

Let's try fill them.

In [91]:
car_Sales_missing.dtypes

Make         object
Colour       object
Odometer    float64
Doors       float64
Price        object
dtype: object

In [92]:
# Fill the Odometer column missing values with the mean of the column inplace
car_Sales_missing["Odometer"].fillna(car_Sales_missing["Odometer"].mean())

0    150043.000000
1     87899.000000
2     92302.666667
3     11179.000000
4    213095.000000
5     92302.666667
6     92302.666667
7     92302.666667
8     60000.000000
9     31600.000000
Name: Odometer, dtype: float64

In [97]:
# View the car sales missing DataFrame and verify the changes
car_Sales_missing["Odometer"]=car_Sales_missing["Odometer"].fillna(car_Sales_missing["Odometer"].mean())
car_Sales_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [100]:
# Remove the rest of the missing data inplace
car_Sales_missing=car_Sales_missing.dropna()

In [101]:
# Verify the missing values are removed by viewing the DataFrame
car_Sales_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

We'll now start to add columns to our DataFrame.

In [103]:
# Create a "Seats" column where every row has a value of 5
Seat=pd.Series([5,5,5,5,5])
car_sales["Seat"]=Seat
car_sales

     Make Colour  Odometer (KM)  Doors  Price  Seat
0  toyota  White         150043      4   4000   5.0
1   honda    Red          87899      4   5000   5.0
2  toyota   Blue          32549      3   7000   5.0
3     bmw  Black          11179      5  22000   5.0
4  nissan  White         213095      4   3500   5.0
5  toyota  Green          99213      4   4500   NaN
6   honda   Blue          45698      4   7500   NaN
7   honda   Blue          54738      4   7000   NaN
8  toyota  White          60000      4   6250   NaN
9  nissan  White          31600      4   9700   NaN

In [107]:
# Create a column called "Engine Size" with random values between 1.3 and 4.5
# Remember: If you're doing it from a Python list, the list has to be the same length
# as the DataFrame
enigine=[1.3,2.3,3.8,2.6,2.2,3.6,1.8,2.0,3.0,4.0]
car_sales["Engine Size"]=enigine
car_sales

     Make Colour  Odometer (KM)  Doors  Price  Seat  Engine Size
0  toyota  White         150043      4   4000   5.0          1.3
1   honda    Red          87899      4   5000   5.0          2.3
2  toyota   Blue          32549      3   7000   5.0          3.8
3     bmw  Black          11179      5  22000   5.0          2.6
4  nissan  White         213095      4   3500   5.0          2.2
5  toyota  Green          99213      4   4500   NaN          3.6
6   honda   Blue          45698      4   7500   NaN          1.8
7   honda   Blue          54738      4   7000   NaN          2.0
8  toyota  White          60000      4   6250   NaN          3.0
9  nissan  White          31600      4   9700   NaN          4.0

In [114]:
# Create a column which represents the price of a car per kilometer
# Then view the DataFrame
car_sales["Total fuel used "] = car_sales["Odometer (KM)"]/100 * car_sales["Engine Size"]
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seat,Engine Size,Total fuel used
0,toyota,White,150043,4,4000,5.0,1.3,1950.559
1,honda,Red,87899,4,5000,5.0,2.3,2021.677
2,toyota,Blue,32549,3,7000,5.0,3.8,1236.862
3,bmw,Black,11179,5,22000,5.0,2.6,290.654
4,nissan,White,213095,4,3500,5.0,2.2,4688.090
5,toyota,Green,99213,4,4500,NaN,3.6,3571.668
6,honda,Blue,45698,4,7500,NaN,1.8,822.564
7,honda,Blue,54738,4,7000,NaN,2.0,1094.760
8,toyota,White,60000,4,6250,NaN,3.0,1800.000
9,nissan,White,31600,4,9700,NaN,4.0,1264.000

In [123]:
# Remove the last column you added using .drop()
car_sales.drop(["Total fuel used "],axis=1,inplace=True)

In [124]:
# Shuffle the DataFrame using sample() with the frac parameter set to 1
# Save the the shuffled DataFrame to a new variable
car_Sales_shuffled=car_sales.sample(frac=1)
car_Sales_shuffled

     Make Colour  Odometer (KM)  Doors  Price  Seat  Engine Size
6   honda   Blue          45698      4   7500   NaN          1.8
3     bmw  Black          11179      5  22000   5.0          2.6
4  nissan  White         213095      4   3500   5.0          2.2
2  toyota   Blue          32549      3   7000   5.0          3.8
1   honda    Red          87899      4   5000   5.0          2.3
9  nissan  White          31600      4   9700   NaN          4.0
5  toyota  Green          99213      4   4500   NaN          3.6
8  toyota  White          60000      4   6250   NaN          3.0
0  toyota  White         150043      4   4000   5.0          1.3
7   honda   Blue          54738      4   7000   NaN          2.0

Notice how the index numbers get moved around. The [`sample()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sample.html) function is a great way to get random samples from your DataFrame. It's also another great way to shuffle the rows by setting `frac=1`.

In [125]:
# Reset the indexes of the shuffled DataFrame
car_Sales_shuffled.reset_index(drop=True,inplace=True)

Notice the index numbers have been changed to have order (start from 0).

In [126]:
# Change the Odometer values from kilometers to miles using a Lambda function
# Then view the DataFrame
car_sales["Odometer (KM)"] = car_sales["Odometer (KM)"].apply(lambda x: x / 1.6)
car_sales

     Make Colour  Odometer (KM)  Doors  Price  Seat  Engine Size
0  toyota  White      93776.875      4   4000   5.0          1.3
1   honda    Red      54936.875      4   5000   5.0          2.3
2  toyota   Blue      20343.125      3   7000   5.0          3.8
3     bmw  Black       6986.875      5  22000   5.0          2.6
4  nissan  White     133184.375      4   3500   5.0          2.2
5  toyota  Green      62008.125      4   4500   NaN          3.6
6   honda   Blue      28561.250      4   7500   NaN          1.8
7   honda   Blue      34211.250      4   7000   NaN          2.0
8  toyota  White      37500.000      4   6250   NaN          3.0
9  nissan  White      19750.000      4   9700   NaN          4.0

## Exteranal links:
If you want to learn in more depth I would prefer to go through the documentation which i will be providing below:
1) https://pandas.pydata.org/docs/
2) Stack Overflow (website) [This is one of the best website for each documentation required to learn or understand overall Machine Learning]
3)